; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-6)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(free left)
(at ball1 room3)
(at ball2 room5)
(at ball3 room5)
(at ball4 room6)
(at ball5 room6)
(at ball6 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 room5)
)
)
)

; plan
1. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 0 of 6
2. (pick ball6 room6 left)
   deleted: (at ball6 room6) (free left)
   added: (carry ball6 left)
   goals met: 0 of 6
3. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 0 of 6
4. (drop ball6 room5 left)
   deleted: (carry ball6 left)
   added: (at ball6 room5) (free left)
   goals met: 1 of 6
5. (pick ball3 room5 left)
   deleted: (at ball3 room5) (free left)
   added: (carry ball3 left)
   goals met: 1 of 6
6. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 1 of 6
7. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 2 of 6
8. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 2 of 6
9. (pick ball5 room6 left)
   deleted: (at ball5 room6) (free left)
   added: (carry ball5 left)
   goals met: 2 of 6
10. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 2 of 6
11. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 3 of 6
12. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 3 of 6
13. (pick ball4 room6 left)
   deleted: (at ball4 room6) (free left)
   added: (carry ball4 left)
   goals met: 3 of 6
14. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 3 of 6
15. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 4 of 6
16. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 4 of 6
17. (pick ball2 room5 left)
   deleted: (at ball2 room5) (free left)
   added: (carry ball2 left)
   goals met: 4 of 6
18. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 4 of 6
19. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 4 of 6
20. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 5 of 6
21. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 5 of 6
22. (pick ball1 room3 left)
   deleted: (at ball1 room3) (free left)
   added: (carry ball1 left)
   goals met: 5 of 6
23. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 5 of 6
24. (drop ball1 rooma left)
   deleted: (carry ball1 left)
   added: (at ball1 rooma) (free left)
   goals met: 6 of 6
